---
type: LabelUtils
namespace: Autodesk.Revit.DB
version: 2024
members: 10
tags: [revit-api, class]
---

# LabelUtils

`Autodesk.Revit.DB.LabelUtils` · Revit 2024 · 10 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | Dispose | — | `public void Dispose ()` |
| Method | GetLabelFor | — | `` |
| Method | GetLabelForBuiltInParameter | — | `` |
| Method | GetLabelForDiscipline | 2022 | `public static string GetLabelForDiscipline ( ForgeTypeId disciplineTypeId )` |
| Method | GetLabelForGroup | — | `public static string GetLabelForGroup ( ForgeTypeId groupTypeId )` |
| Method | GetLabelForSpec | 2011 | `public static string GetLabelForSpec ( ForgeTypeId specTypeId )` |
| Method | GetLabelForSymbol | 2014 | `public static string GetLabelForSymbol ( ForgeTypeId symbolTypeId )` |
| Method | GetLabelForUnit | 2011 | `public static string GetLabelForUnit ( ForgeTypeId unitTypeId )` |
| Method | GetStructuralSectionShapeName | 2011 | `public static string GetStructuralSectionShapeName ( StructuralSectionShape shape )` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |